; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v12 ?v8)
             (pred_9 ?v10 ?v1)
             (pred_5 ?v12 ?v1)
             (pred_10 ?v7 ?v12 )
	     (pred_1 ?v12)
             (pred_3 ?v9)
             (pred_12 ?v10)
             (pred_8 ?v1)
             (pred_7 ?v12)
             (pred_6 ?v10)
             (pred_11 ?v12)
             (pred_2 ))



(:action op_1
:parameters (?v2 ?v11 ?v13 ?v5)
:precondition (and (pred_3 ?v2) (pred_3 ?v11) (pred_12 ?v13) (pred_8 ?v5)
          (pred_4 ?v2 ?v11) (pred_9 ?v13 ?v5)
                   (pred_5 ?v11 ?v5) (pred_1 ?v2) 
                   (pred_7 ?v11) (pred_6 ?v13))
:effect (and  (pred_11 ?v11) (not (pred_7 ?v11))))


(:action op_2
:parameters (?v2 ?v6)
:precondition (and (pred_3 ?v2) (pred_3 ?v6)
               (pred_1 ?v2) (pred_4 ?v2 ?v6) (pred_11 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v2))))

(:action op_3
:parameters (?v2 ?v13)
:precondition (and (pred_3 ?v2) (pred_12 ?v13) 
                  (pred_1 ?v2) (pred_10 ?v13 ?v2) (pred_2 ))
:effect (and (pred_6 ?v13)
   (not (pred_10 ?v13 ?v2)) (not (pred_2 ))))


(:action op_4
:parameters (?v2 ?v3 ?v4)
:precondition (and (pred_3 ?v2) (pred_12 ?v3) (pred_12 ?v4)
                  (pred_1 ?v2) (pred_6 ?v4) (pred_10 ?v3 ?v2))
:effect (and (pred_6 ?v3) (pred_10 ?v4 ?v2)
        (not (pred_6 ?v4)) (not (pred_10 ?v3 ?v2))))

(:action op_5
:parameters (?v2 ?v13)
:precondition (and (pred_3 ?v2) (pred_12 ?v13) 
                  (pred_1 ?v2) (pred_6 ?v13))
:effect (and (pred_2 ) (pred_10 ?v13 ?v2) (not (pred_6 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_02 obj_09 obj_03 obj_07 obj_13 obj_12 obj_04 obj_01
    obj_11 obj_06
    obj_05 obj_08
    )

    (:init
       (pred_2)

       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_09)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_13)
       (pred_3 obj_12)
       (pred_3 obj_04)
       (pred_3 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_12 obj_05)
       (pred_12 obj_08)

       (pred_4 obj_10 obj_03)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_5  obj_12 obj_11)
       (pred_5  obj_03 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_07)
       (pred_11 obj_13)
       (pred_11 obj_04)
       (pred_11 obj_01)

       (pred_9  obj_05 obj_11)
       (pred_9  obj_08 obj_06)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_08 obj_09)
       (pred_1 obj_01)
    )

    (:goal (and
       (pred_10 obj_05 obj_09)
    ))
(:constraints
  (always (not (pred_1 obj_13)))
)
)

; plan
1. (op_2 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 0 of 1
2. (op_2 obj_04 obj_07)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_05)
   deleted: (pred_10 obj_05 obj_07) (pred_2)
   added: (pred_6 obj_05)
   goals met: 0 of 1
4. (op_2 obj_07 obj_02)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_02)
   goals met: 0 of 1
5. (op_2 obj_02 obj_09)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_09)
   goals met: 0 of 1
6. (op_4 obj_09 obj_08 obj_05)
   deleted: (pred_6 obj_05) (pred_10 obj_08 obj_09)
   added: (pred_6 obj_08) (pred_10 obj_05 obj_09)
   goals met: 1 of 1
